[CFMain]
MemoryLoadTool="Memory Loader Tools"
LanguageSelect="Language"
ENG="English"
JPN="Japanese"
CHS="Chinese"
UpLoad="Upload\n(Display->Storage)"
UpLoadQ="Upload\n(->Storage)"
DownLoad="Download\n(Storage->Display)"
DownLoadQ="Download\n(->Display)"
Menu="Menu"
Exit="Exit"
VerFix="Ver."

[CFMenu]
MemoryLoadMenu="Memory Loader Tool Menu"
UpLoad="Upload (Display->Storage)"
DownLoad="Download (Storage->Display)"
SysInfo="System Information"
Comp="Compare Internal Data to Storage"
FileView="View Storage files"
Back="Back"
Exit="Exit"

[CFUpLoad]
MemoryLoadTitle="Upload (Display->Storage)"
PathFix="Path Name:"
FileFix="File Name:"
FileName=""
PassFix="Password:"
Message="Please input the password and press the Start switch."
MessageQ1="Please input the password and"
MessageQ2="press the Start switch."
Start="Start"
FolderSelect="Select Folder"
FolderSelectQ="Folder"
NewFile="New File"
NewFileQ="New File"
FileSelect="Select File"
FileSelectQ="File"
Back="Back"
NoPasswordQ1=Password not set.

[CFDownLoad]
MemoryLoadTitle="Download (Storage->Display)"
Coution="Warning: Data in the internal memory will be lost."
CoutionQ1="Warning:"
CoutionQ2="Data in the internal memory"
CoutionQ3="will be lost."
FileFix="Path Name:"
PassFix="Password :"
Message="Please input the password and press the Start switch."
MessageQ1="Please input the password and"
MessageQ2="press the Start switch."
Start="Start"
FileSelect="Select File"
FileSelectQ="Select File"
Back="Back"
NoPasswordQ1=Password not set.

[FileSelect]
MemoryLoadTitle="Select File"
MemoryLoadTitleQ="File List"
FileFix="Current File Name:"
FileFixQ="File:"
ViewFileName="File Name"
ViewFileNameQ="File Name"
ViewSize="Size"
ViewTime="Time Stamp"
FreeSpaceOfCF="Storage Free Space:"
CFkb="KB"
FileInfo="File Info"
Kind="Model Name"
Comment="Comment"
Enter="Enter"
Info="Details"
Back="Back"
ReName="Rename"
ReNameQ="Change"
Delete="Delete"
Copy="Copy"

[SysInfo]
MemoryLoadTitle="System Information (Internal Data)"
MemoryLoadTitleQ="System Information"
MemoryLoadTitleQ2="(Internal Data)"
System="[System Information]"
Cologne1=":"
Cologne2=":"
Kind="Model Name　　　　　 　"
FameVar="Sub System Version"
FameVarQ="Sub System"
RuntimeVar="System Version"
RuntimeVarQ="System"
Protcol1="Driver Version"
Protcol1Q="Driver Version"
Iodriver1="I/O Driver Version"
Iodriver1Q="I/O Driver Version"
DevMonVer="Device Monitor Version "
DevMonVerQ="Device Monitor Version "
Disp="[Project Information]"
SoftVar="Editor Version"
SoftVarQ="Editor Version"
PrjFile="Project File Name"
PrjFileQ="Project File Name"
PrjDate="Date"
PrjComment="Comment　"
PrjCommentQ="Comment　"
CFInfo="Storage Info"
CFInfoQ="Storage"
Return="Previous Page"
Next="Next Page"
Return2="Previous Page"
Next2="Next Page"
Back="Back"

[CFInfo]
MemoryLoadTitle="System Information (Storage Data)"
MemoryLoadTitleQ="System Information"
MemoryLoadTitleQ2="(Storage Data)"
System="[System Information]"
Cologne1=":"
Cologne2=":"
Kind="Model Name　　　　　　　　"
FameVar="Sub System Version"
FameVarQ="Sub System"
RuntimeVar="System Version"
RuntimeVarQ="System"
Protcol1="Driver Version　　　　　"
Protcol1Q="Driver Version"
Iodriver1="I/O Driver Version　　　　　"
Iodriver1Q="I/O Driver Version"
DevMonVer="Device Monitor Version "
DevMonVerQ="Device Monitor Version "
Disp="[Project Information]"
SoftVar="Editor Version　"
SoftVarQ="Editor Version"
PrjFile="Project File Name"
PrjFileQ="Project File Name"
PrjDate="Date　　　"
PrjComment="Comment　"
PrjCommentQ="Comment　"
FileNameFix="Backup File Name　"
DateFix="Date"
SysInfo="Internal Info"
SysInfoQ="Internal"
Return="Previous Page"
Next="Next Page"
Return2="Previous Page"
Next2="Next Page"
Back="Back"

[Copy]
CopyMoto="Copy Source"
CopyMotoQ="Copy Src"
CopySaki="Copy Destination"
CopySakiQ="Copy Dst"
PathFix="Path Name"
FailFix="File Name"
Colon=":"
Announce=""
FolderSelect="Select Folder"
Enter="Enter"
Back="Back"

[Delete]
MemoryLoadTitle="Delete File"
FileFix="File Name:"
Message="Are you sure to delete the file?"
Announce=""
Yes="YES"
No="NO"
Back="Back"

[FileName]
MemoryLoadTitle="Input File Name"
MemoryLoadTitleQ="Input File Name"
PathFix="Path Name:"
Message="Please input the file name and touch Confirm."
FileFix="New File Name:"
FileFixQ="File Name:"
Enter="Enter"
Back="Back"

[FileComp]
MemoryLoadTitle="Compare Internal Data to Storage"
FileFix="File Name:"
Message="Please press the Start switch."
Bigin="Start"
ViewName="Mismatch List"
ViewFileName="Name"
FileSelect="Select File"
Back="Back"

[@Message]
TITLE="Message"
YES="Yes"
NO="No"
OK="Ok"
Download="Do you want to download the data?"
ExitSystem="Are you sure to restart the system?"
OverWrite="Are you sure to overwrite the data?"

[@ErrMessage]
TITLE="ErrMessage"

[Announce]
ER_BASEBOARDID=Incorrect model.
ER_FILENAME=Please input a file name.
ER_FILECOPY=Failed to copy the file.
ER_NG_CF=The storage location not found.
ER_NG_SIZE=Cannot write to storage.
ER_NG_READ=Storage data error.
ER_NG_WRITEPROTECT=The storage is write-protected.
CP_FILECOPY=Executing File Copy
ER_PASSWORD=Incorrect password.
ER_PATHLEN=The path is too long.
UP_WRITE_NAND=Reading system/project data...
UP_FINISH_NAND=Checking the read data...
UP_FINISH_NAND_END=Checking data is completed.
UP_OK_END=Successfully completed.
UP_NG_END=Abnormally terminated.
DW_INIT_NAND=Reading data on the display unit...
DW_WRITE_NAND=Writing system/project data...
DW_WRITE_NAND_END=System/Project data write completed 
DW_OK_END=Successfully completed.
DW_NG_END=Abnormally terminated.
CMP_NAND=Comparing system/project data…
CMP_NANDEND=System/Project data comparison completed 
CMP_END=Successfully completed.
CMP_ABOUT=Mismatch detected.
CMP_DIF_NOR=Sub System Program
CMP_DIF_SRAM=SRAM Data
CMP_DIF_SYSTEM=System Data
CMP_DIF_NPJ=NetWork Project
CMP_DIF_USER=User Data
CMP_DIF_FONT=Font Data
CMP_DIF_LOGIC=Logic Data
CMP_DIF_RUNTIME=System Program
CMP_DIF_PROTOCOL=Protocol
CMP_DIF_CONTROL=Control Program
CMP_DIF_EXTEND=Extended Program
CMP_DIF_WEBSVR=WebServer Program
CMP_DIF_WFONT=Image Font File
CMP_DIF_SYSTEMSCR=System Screen Information
CMP_DIF_STARTUPIMAGE=Image
CMP_DIF_RECIPE=Extended Recipe
CMP_DIF_UNKNOWN=Unknown Data
MSG_RETURN=Please push the Back button.

[FolderSelect]
MemoryLoadTitle="Select Folder"
FolderFix="Current Folder Name:"
ViewFileNameQ="File Name"
ViewSize="Size"
ViewTime="Time Stamp"
FreeSpaceOfCF="Strage Free Space:"
CFkb="KB"
Enter="Enter"
Back="Back"

[CFUpLoading]
MemoryLoadTitle="Upload"
PathFix="Path Name:"
FileFix="File Name:"
Back="Back"

[CFDownLoading]
MemoryLoadTitle="Download"
Coution="Warning: Data in the internal memory will be lost."
CoutionQ1="Warning: "
CoutionQ2="Data in the internal memory"
CoutionQ3="will be lost."
FileFix="File Name:"
Back="Back"
